In [1]:
import pandas as pd 
import numpy as np
import datetime as dt

#### CRM (Customer Realtionship Management)

- Customer funnel/lifecycle/journey (Müşteri Yaşam Döngüsü)
- Müşteri bulma çalışmaları
- Customer Churn(terk etme)
- Müşteri Segmentasyonu
- Cross-sell(Çapraz Satış)
- Up-sell (üst satış)

#### Key Performance Indicators(KPIs)
- Şirket,departman veya takımın performansını gösteren matematiksel ifadelerdir

- Net Profit (Net kar)
- Net Profit Margin (Net kar marjı)
- Revenue Growth Rate (Gelir artış oranı)
- Customer Retention Rate (Müşteri koruma oranı)
- Customer Lifetime Value (Müşteri yaşan süresi değeri)
- Market Growth Rate (Pazar gelişme oranı)
- Cost per Lead (Müşteri yaratma maliyeti)
- Customer Acquisiton Rate (Müşteri kazanma oranı)
- Customer Churn Rate (Müşteri terk oranı)
- Conversion Rate (Dönüşüm oranı)

#### Customer Segmentation with RFM

- Müşterilerin satın alma alışkanlıkları üzerinden gruplara ayrılması ve bu gruplar üzerinden stratejiler geliştirmesini sağlar 

- RFM 
- Recency = Güncellik,sıklık
- Frequency = Frekans
- Monetary = Miktar,Parasal

In [2]:
df_ = pd.read_excel("online_retail_II.xlsx",sheet_name="Year 2009-2010")

In [3]:
df_.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [4]:
df = df_.copy()

In [5]:
df.columns

Index(['Invoice', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'Price', 'Customer ID', 'Country'],
      dtype='object')

In [6]:
df.shape

(525461, 8)

In [7]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
dtype: int64

In [8]:
df["Description"].nunique()

4681

In [10]:
df["Description"].value_counts().head(10)

WHITE HANGING HEART T-LIGHT HOLDER    3549
REGENCY CAKESTAND 3 TIER              2212
STRAWBERRY CERAMIC TRINKET BOX        1843
PACK OF 72 RETRO SPOT CAKE CASES      1466
ASSORTED COLOUR BIRD ORNAMENT         1457
60 TEATIME FAIRY CAKE CASES           1400
HOME BUILDING BLOCK WORD              1386
JUMBO BAG RED RETROSPOT               1310
LUNCH BAG RED SPOTTY                  1274
REX CASH+CARRY JUMBO SHOPPER          1232
Name: Description, dtype: int64

In [11]:
df.groupby("Description").agg({"Quantity" : "sum"}).head()

                                     Quantity
Description
21494                                    -720
22467                                      -2
22719                                       2
  DOORMAT UNION JACK GUNS AND ROSES       179
 3 STRIPEY MICE FELTCRAFT                 690

In [12]:
df.groupby("Description").agg({"Quantity" : "sum"}).sort_values("Quantity",
                                                                ascending=False).head()

                                    Quantity
Description
WHITE HANGING HEART T-LIGHT HOLDER     57733
WORLD WAR 2 GLIDERS ASSTD DESIGNS      54698
BROCADE RING PURSE                     47647
PACK OF 72 RETRO SPOT CAKE CASES       46106
ASSORTED COLOUR BIRD ORNAMENT          44925

In [13]:
df["Invoice"].nunique()

28816

In [14]:
df["TotalPrice"] = df["Price"] * df["Quantity"]

In [15]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,100.8
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,30.0

In [16]:
# Fişlere göre total priceın toplamı 
df.groupby("Invoice").agg({"TotalPrice" : "sum"}).head()

         TotalPrice
Invoice
489434       505.30
489435       145.80
489436       630.33
489437       310.75
489438      2286.24

In [17]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Quantity,525461.0,10.337667,107.424110,-9600.00,1.00,3.00,10.00,19152.00
Price,525461.0,4.688834,146.126914,-53594.36,1.25,2.10,4.21,25111.09
Customer ID,417534.0,15360.645478,1680.811316,12346.00,13983.00,15311.00,16799.00,18287.00
TotalPrice,525461.0,18.154506,160.333083,-53594.36,3.75,9.95,17.70,25111.09

In [18]:
# Veri setinde fiyata - çıkmasının sebebi iadelerdir
# İadelerle bizim işimiz yok bu yüzden çıkaracağız

df = df[(df["Quantity"] > 0)]

In [19]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,TotalPrice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,83.4
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,81.0
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,100.8
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,30.0

In [20]:
len(df)

513135

In [21]:
df.dropna(inplace=True)

In [22]:
df.shape

(407695, 9)

In [23]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
TotalPrice     0
dtype: int64

In [26]:
# İçinde C harfi olanları yani iadeleri düşüreceğiz
# İçinde C olanları al tilda(~) ile olmayanları getir df e at

In [24]:
#Invoice içinde string olmayan değerler var np.nan gibi
df["Invoice"] = df["Invoice"].fillna("")

In [27]:
df = df[~df["Invoice"].astype(str).str.contains("C",na=False)]

In [29]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Invoice,407695.0,514760.707239,14101.015474,489434.0,502764.00,515303.00,527104.00,538171.0
Quantity,407695.0,13.586686,96.842229,1.0,2.00,5.00,12.00,19152.0
Price,407695.0,3.294188,34.756655,0.0,1.25,1.95,3.75,10953.5
Customer ID,407695.0,15368.504107,1679.795700,12346.0,13997.00,15321.00,16812.00,18287.0
TotalPrice,407695.0,21.663261,77.147356,0.0,4.95,11.90,19.50,15818.4

In [30]:
#Burada başında C olan ifadeleri attık

In [31]:
# Şu anda tarih değşkeni ile ilgileceğiz

df["InvoiceDate"].max()

Timestamp('2010-12-09 20:01:00')

In [32]:
# Yeni bir today date diye atama yapmamız gerekiyor Recency için
# 2 gün sonrasına atıyoruz today date i sanki o tarihteymişiz gibi
today_date = dt.datetime(2010,12,11)

In [35]:
type(today_date)

datetime.datetime

In [36]:
# Customer ID lere göre groupby yapacağız
# Recency için (Today Date - Invoice Date) yapacağız
# Frequency Invoice in kendisidir kaç tane olduğu
# Total price ise Monetary değeridir.

In [37]:
rfm = df.groupby("Customer ID").agg({"InvoiceDate" : lambda InvoiceDate : (today_date - InvoiceDate.max()).days,
                                     "Invoice" : lambda Invoice : Invoice.nunique(),
                                     "TotalPrice" : lambda TotalPrice : TotalPrice.sum()})

In [39]:
# Recency: Customer Id leri groupby işlemi yaptık ve teke indirdik
# Frequency: Today date ten InvoiceDate.max() çıkararak en son ne zaman geldiğini bulduk
# Monetary: Total price ların toplamını bularak da toplam fiyatı yazdık

In [38]:
rfm.head()

             InvoiceDate  Invoice  TotalPrice
Customer ID
12346.0              165       11      372.86
12347.0                3        2     1323.32
12348.0               74        1      222.16
12349.0               43        3     2671.14
12351.0               11        1      300.93

In [40]:
rfm.columns = ["Recency","Frequency","Monetary"]

In [41]:
rfm.head()

             Recency  Frequency  Monetary
Customer ID
12346.0          165         11    372.86
12347.0            3          2   1323.32
12348.0           74          1    222.16
12349.0           43          3   2671.14
12351.0           11          1    300.93

In [42]:
rfm.describe().T

,count,mean,std,min,25%,50%,75%,max
Recency,4314.0,91.269819,96.944304,1.0,18.00,53.00,136.0000,374.00
Frequency,4314.0,4.454103,8.168658,1.0,1.00,2.00,5.0000,205.00
Monetary,4314.0,2047.288659,8912.523243,0.0,307.95,705.55,1722.8025,349164.35

In [43]:
rfm = rfm[(rfm["Monetary"] > 0 )] # Monetary 0 olanları çıkar

In [44]:
rfm.shape

(4312, 3)

In [46]:
# Puanlama sistemini pdcut fonksiyonu ile yapacağız
# Recency değişkenini 5 e böldk ve az olan bizim iin değerli olduğu için
# 5ten geriye dopru verdik
rfm["recency_score"] = pd.qcut(rfm["Recency"],5,labels=[5,4,3,2,1])

In [47]:
rfm.head()

             Recency  Frequency  Monetary recency_score
Customer ID
12346.0          165         11    372.86             2
12347.0            3          2   1323.32             5
12348.0           74          1    222.16             2
12349.0           43          3   2671.14             3
12351.0           11          1    300.93             5

In [48]:
rfm["frequency_score"] = pd.qcut(rfm["Frequency"].rank(method="first"),5,labels=[1,2,3,4,5])
rfm["monetary_score"] = pd.qcut(rfm["Monetary"],5,labels=[1,2,3,4,5])

In [49]:
rfm.head()

,Recency,Frequency,Monetary,recency_score,frequency_score,monetary_score
Customer ID,,,,,,
12346.0,165,11,372.86,2,5,2
12347.0,3,2,1323.32,5,2,4
12348.0,74,1,222.16,2,1,1
12349.0,43,3,2671.14,3,3,5
12351.0,11,1,300.93,5,1,2

In [50]:
# Artık yeni bir değişken atıyoruz ve RF skorlarını yazdıracağız string olarak
rfm["RFM_SCORE"] = (rfm["recency_score"].astype(str) + rfm["frequency_score"].astype(str))

In [51]:
rfm.head()

,Recency,Frequency,Monetary,recency_score,frequency_score,monetary_score,RFM_SCORE
Customer ID,,,,,,,
12346.0,165,11,372.86,2,5,2,25
12347.0,3,2,1323.32,5,2,4,52
12348.0,74,1,222.16,2,1,1,21
12349.0,43,3,2671.14,3,3,5,33
12351.0,11,1,300.93,5,1,2,51

In [53]:
rfm.describe().T

,count,mean,std,min,25%,50%,75%,max
Recency,4312.0,91.172542,96.861457,1.00,18.0000,53.00,136.0000,374.00
Frequency,4312.0,4.455705,8.170213,1.00,1.0000,2.00,5.0000,205.00
Monetary,4312.0,2048.238236,8914.481280,2.95,307.9875,706.02,1723.1425,349164.35

In [54]:
# Regex ile isimlendireceğiz sözlük yapısında
seg_map = {
    r'[1-2][1-2]' : 'hibernating',
    r'[1-2][3-4]' : 'at_Risk',
    r'[1-2]5' : 'cant_loose',
    r'3[1-2]' : 'about_to_sleep',
    r'33' : 'need_attention',
    r'[3-4][4-5]' : 'loyal_customers',
    r'41' : 'promising',
    r'51' : 'new_customers',
    r'[4-5][2-3]' : 'potential_loyallists',
    r'5[4-5]' : 'champions'
}

In [56]:
#Segmentlere ayırma işlemi
rfm["segment"] = rfm["RFM_SCORE"].replace(seg_map,regex=True)

In [57]:
rfm.head()

,Recency,Frequency,Monetary,recency_score,frequency_score,monetary_score,RFM_SCORE,segment
Customer ID,,,,,,,,
12346.0,165,11,372.86,2,5,2,25,cant_loose
12347.0,3,2,1323.32,5,2,4,52,potential_loyallists
12348.0,74,1,222.16,2,1,1,21,hibernating
12349.0,43,3,2671.14,3,3,5,33,need_attention
12351.0,11,1,300.93,5,1,2,51,new_customers

In [58]:
rfm["segment"].value_counts()

hibernating             1015
loyal_customers          742
champions                663
at_Risk                  611
potential_loyallists     517
about_to_sleep           343
need_attention           207
promising                 87
cant_loose                77
new_customers             50
Name: segment, dtype: int64

In [59]:
rfm["segment"].value_counts() / len(rfm) * 100

hibernating             23.538961
loyal_customers         17.207792
champions               15.375696
at_Risk                 14.169759
potential_loyallists    11.989796
about_to_sleep           7.954545
need_attention           4.800557
promising                2.017625
cant_loose               1.785714
new_customers            1.159555
Name: segment, dtype: float64

In [67]:
final_rfm = rfm[["segment","Recency","Frequency","Monetary"]].groupby("segment").agg(["mean","count"])

In [68]:
final_rfm

                         Recency        Frequency           Monetary
                            mean count       mean count         mean count
segment
about_to_sleep         53.819242   343   1.201166   343   441.320000   343
at_Risk               152.158756   611   3.073650   611  1188.878316   611
cant_loose            124.116883    77   9.116883    77  4099.450000    77
champions               7.119155   663  12.553544   663  6852.264167   663
hibernating           213.885714  1015   1.126108  1015   403.977836  1015
loyal_customers        36.287062   742   6.830189   742  2746.067353   742
need_attention         53.265700   207   2.449275   207  1060.357005   207
new_customers           8.580000    50   1.000000    50   386.199200    50
potential_loyallists   18.793037   517   2.017408   517   729.510986   517
promising              25.747126    87   1.000000    87   367.086782    87

In [69]:
# new customers getir 

new_customers_df = pd.DataFrame()

In [71]:
new_customers_df["new_customers_id"] = rfm[rfm["segment"] == "new_customers"].index

In [73]:
new_customers_df.head()

   new_customers_id
0           12351.0
1           12385.0
2           12386.0
3           12427.0
4           12441.0

In [74]:
#champions 

champions_df = pd.DataFrame()

In [75]:
champions_df["champions_id"] = rfm[rfm["segment"] == "champions"].index

In [76]:
champions_df.head()

   champions_id
0       12360.0
1       12395.0
2       12415.0
3       12429.0
4       12431.0